app/controllers/microposts_controller.rb

  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["content", "MyText"], ["user_id", 1], ["created_at", "2024-09-11 07:05:35.710508"], ["updated_at", "2024-09-11 07:05:35.710508"]]

  def destroy
    @micropost.destroy!
---
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 980190962]]