app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Phan Thanh Tam"], ["email", "[FILTERED]"], ["created_at", "2024-09-16 06:29:23.757756"], ["updated_at", "2024-09-16 06:29:23.757756"], ["password_digest", "[FILTERED]"]]