app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: Settings.defaults.users_per_page)
---
SELECT "users".* FROM "users"

  def destroy
    if @user
      @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]